Revit 2027 API
ScheduleField.CreatesCircularReferences Method
 Checks whether a field ID would create a circular chain of references when used by the PercentageOf property of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CreatesCircularReferences(
	ScheduleFieldId fieldId
)
Public Function CreatesCircularReferences (
	fieldId As ScheduleFieldId
) As Boolean
public:
bool CreatesCircularReferences(
	ScheduleFieldId^ fieldId
)
member CreatesCircularReferences :
        fieldId : ScheduleFieldId -> bool
Parameters
fieldId ScheduleFieldId
 The field ID to check.
Return Value
Boolean
 True if the field ID would create a circular chain of references, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not InvalidScheduleFieldId or the ID of a field that can be used to calculated percentages.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace